app/views/relationships/followerlist.html.erb

          <tr>
          <% @user.follower_user.each do |follower| %>
---
SELECT "users".* FROM "users"