app/views/relationships/followlist.html.erb

          <tr>
          <% @user.following_user.each do |follower| %>
---
SELECT "users".* FROM "users"