app/views/books/index.html.erb

              <% end %>
              <span><%= book.favorites.count %>いいね</span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]


            <td><%= book.book_comments.count %>件コメント</td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]