app/views/books/show.html.erb

              <th>follows</th>
              <th><%= link_to @book.user.follower.count, user_followlist_path(@book.user) %></th>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

                          <% end %>
                          <span><%= @book.favorites.count %>いいね</span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

                          <% end %>
                          <span><%= @book.favorites.count %>いいね</span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]

                            <i class="fa fa-comment">コメント数：</i>
                            <a href="#comments"><%= @book.book_comments.count %></a>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]

                <div class="float-wrapper">
                    <h2 class="comment-count"><%= @book.book_comments.count %>件コメント</h2>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]

                    <!--コメント一覧部分-->
                    <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]