app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                          <% end %>
                          <span><%= @book.favorites.count %>いいね</span>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                            <i class="fa fa-comment">コメント数：</i>
                            <a href="#comments"><%= @book.book_comments.count %></a>