app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "hanamoto"], ["body", "1"], ["created_at", "2020-10-03 03:07:21.185284"], ["updated_at", "2020-10-03 03:07:21.185284"], ["user_id", 1]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = current_user
    if @book.save
    redirect_to book_path(@book.id), notice: "You have creatad book successfully."
    else
      @books = Book.all