app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @new = Book.new
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id

    if @book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "イェーイ！！"], ["user_id", 1], ["book_id", 8], ["created_at", "2020-10-04 04:34:39.071409"], ["updated_at", "2020-10-04 04:34:39.071409"]]

  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 12]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 12], ["book_id", 1], ["LIMIT", 1]]